In [2]:
import numpy as np 
import pandas as pd

In [3]:
df = pd.read_csv('Salaries.csv')
df

C:\Users\Loay_Alrazi\AppData\Local\Temp\ipykernel_23916\3499069451.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [4]:
df.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

In [5]:
df.describe().round(2)

              Id   TotalPay  TotalPayBenefits       Year  Notes
count  148654.00  148654.00         148654.00  148654.00    0.0
mean    74327.50   74768.32          93692.55    2012.52    NaN
std     42912.86   50517.01          62793.53       1.12    NaN
min         1.00    -618.13           -618.13    2011.00    NaN
25%     37164.25   36169.00          44065.65    2012.00    NaN
50%     74327.50   71426.61          92404.09    2013.00    NaN
75%    111490.75  105839.14         132876.45    2014.00    NaN
max    148654.00  567595.43         567595.43    2014.00    NaN

# Info

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 148648 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148648 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148648 non-null  object
 3   BasePay           148648 non-null  float64
 4   OvertimePay       148648 non-null  float64
 5   OtherPay          148648 non-null  object
 6   Benefits          112490 non-null  object
 7   TotalPay          148648 non-null  float64
 8   TotalPayBenefits  148648 non-null  float64
 9   Year              148648 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148648 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(5), int64(2), object(6)
memory usage: 15.9+ MB

# What is the Avarage BasePay?

In [6]:
df['BasePay']

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [7]:
print(df['BasePay'].dtype)
print(df['BasePay'].unique)

object
<bound method Series.unique of 0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object>

In [8]:
# يحسب أي خلية تحتوي على النص بغض النظر عن حالة الأحرف
count = df['BasePay'].str.contains('Not Provided', case=False, na=False).sum()
print(count)

4

In [9]:
df["BasePay"] = df["BasePay"].replace('Not Provided', 0 )

In [10]:
df['BasePay']

0         167411.18
1         155966.02
2         212739.13
3           77916.0
4          134401.6
            ...
148649         0.00
148650            0
148651            0
148652            0
148653         0.00
Name: BasePay, Length: 148654, dtype: object

In [11]:
df['BasePay']=df['BasePay'].fillna(0).astype(float)

In [12]:
df['BasePay']

0         167411.18
1         155966.02
2         212739.13
3          77916.00
4         134401.60
            ...
148649         0.00
148650         0.00
148651         0.00
148652         0.00
148653         0.00
Name: BasePay, Length: 148654, dtype: float64

In [13]:
df['BasePay'].mean()

66053.72928807836

# What is the highest amount of OvertimePay in the dataset?

In [14]:
df['OvertimePay']

0                  0.0
1            245131.88
2            106088.18
3             56120.71
4               9737.0
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: OvertimePay, Length: 148654, dtype: object

In [15]:
# يحسب أي خلية تحتوي على النص بغض النظر عن حالة الأحرف
count = df['OvertimePay'].str.contains('Not Provided', case=False, na=False).sum()
print(count)

4

In [16]:
# يحسب عدد الخلايا التي تحتوي على هذه القيمة في كل الجدول
total_count = (df == 'Not Provided').sum().sum()
print(f"الإجمالي في كل الجدول: {total_count}")

الإجمالي في كل الجدول: 14

In [17]:
# الإبقاء فقط على الصفوف التي لا تساوي 'Not Provided'
df = df[df['BasePay'] != 'Not Provided']

In [18]:
# حذف أي صف يحتوي على 'Not Provided' في أي عمود
df = df[~(df == 'Not Provided').any(axis=1)]

In [19]:
df['OvertimePay']

0               0.0
1         245131.88
2         106088.18
3          56120.71
4            9737.0
            ...
148645         0.00
148647         0.00
148648         0.00
148649         0.00
148653         0.00
Name: OvertimePay, Length: 148648, dtype: object

In [20]:
#  تحويل الأعمدة المستهدفة لأرقام لنتمكن من حساب المتوسط والقمة وغيرها

df['OvertimePay'] = pd.to_numeric(df['OvertimePay'])

print("المتوسط:", df['BasePay'].mean())
print("أعلى قيمة:", df['BasePay'].max())

المتوسط: 66055.45257036759
أعلى قيمة: 319275.01

# What is the job title of JOSEPH DRISCOLL? Note: Use all caps, otherwise you may get an answer that dosn't match up (there is a lowercase Joseph Driscoll).

In [21]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

# How much does JOSEPH DRISCOLL make (including benefits)?

In [22]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

# What is the name of highest paid person(including benfits)?

In [23]:
df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [24]:

df[df['TotalPayBenefits']==df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

# What is the name of lowest paid person (including benefits)? Do you notice somthing strange about how much he or she is paid?

In [25]:

df[df['TotalPayBenefits']==df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

# What was the average (mean) BasePay of all employees per year? (2011-2014)?

In [26]:
df['Year'].isnull()

0         False
1         False
2         False
3         False
4         False
          ...
148645    False
148647    False
148648    False
148649    False
148653    False
Name: Year, Length: 148648, dtype: bool

In [33]:
# df.groupby('Year').mean()['BasePay'] 
#  يظهر الخطأ لان العمود يعتبر من نوع اوبجت لذا نقوم بتحويل نوع البيانات

# 1. تحويل العمود إلى أرقام (مهم جداً)
df['BasePay'] = pd.to_numeric(df['BasePay'], errors='coerce')

# 2. إجراء عملية التجميع وحساب المتوسط
result = df.groupby('Year')['BasePay'].mean()

print(result)

Year
2011    63596.112293
2012    65435.950986
2013    68509.832156
2014    66564.421924
Name: BasePay, dtype: float64

# How many unique job titles are there?

In [38]:
df['JobTitle'].nunique()

2158

In [39]:
df['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ...,
       'Forensic Toxicologist Supervis', 'Conversion', 'Cashier 3'],
      dtype=object)

# what are the top 5 most common jobs?

In [46]:
# df['JobTitle'].value_counts().head(5)
# the same 
df['JobTitle'].value_counts()[:5]

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

In [47]:
# if you want the last 5 
df['JobTitle'].value_counts().tail()

JobTitle
BUILDING SERVICES TECHNICIAN            1
TRIAL DELAY REDUCTION COORDINATOR       1
POWERHOUSE ELECTRICIAN SUPERVISOR II    1
CHIEF NURSERY SPECIALIST                1
Cashier 3                               1
Name: count, dtype: int64

# How many job Taitles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

In [ ]:
# df[df['Year']==2013]['JobTitle'].value_counts()
# df[df['Year']==2013]['JobTitle'].value_counts()==1
(df[df['Year']==2013]['JobTitle'].value_counts()==1).sum()

202

# How many people have the word Chief in their Job title?(This is pretty trickly)

In [62]:
def chief (string):
    if 'chief' in (string.lower()):
        return True
    else:
        return False

In [65]:
(df['JobTitle'].apply(lambda x : chief(x))).sum()

627

# Bouns :Is there a corretation between length of the Job Title string and Salary?

In [66]:
df['ntitles']= df['JobTitle'].apply(len)
df['ntitles']

0         46
1         31
2         31
3         36
4         44
          ..
148645    25
148647    27
148648     9
148649     9
148653    26
Name: ntitles, Length: 148648, dtype: int64

In [67]:
df[['ntitles', 'TotalPayBenefits']].corr()

                  ntitles  TotalPayBenefits
ntitles           1.00000          -0.03692
TotalPayBenefits -0.03692           1.00000

# Thank you